// [1]ヘッダーをインクルードする

#include <stdio.h> // [1-1]標準入出力ヘッダーをインクルードする
#include <stdlib.h> // [1-2]標準ライブラリーヘッダーをインクルードする
#include <string.h> // [1-3]文字列操作ヘッダーをインクルードする
#include <time.h>   // [1-4]時間管理ヘッダーをインクルードする
#include <conio.h> // [1-5]コンソール入出力ヘッダーをインクルードする

// [2]定数を定義する場所
#define FIELD_WIDTH  (200) //[2-1]フィールドの幅を定義する
#define FIELD_HEIGHT (200) //[2-2]フィールドの高さを定義する
#define FPS          (10) //[2-3]1秒当たりの更新回数を定義する
#define INTERVAL     (1000/FPS)//[2-4]更新間隔（ミリ秒）を定義する

#define BITS_PER_WORD (32)// int 32ビットで扱うビット数

// フィールドの横幅160セルを32ビット単位で管理する (160 + 32 - 1) / 32 = 5 つまり 5 × 32ビット = 160ビットを用意
#define FIELD_WORD_WIDTH ((FIELD_WIDTH + BITS_PER_WORD - 1 ) / BITS_PER_WORD)

// [3]変数を宣言する場所

// [3-1]フィールドを宣言する
// 
// [Y] の中のintのビット位置 
// : int[ 0 ] → x = 0 ～ 31 int[ 1 ] → x = 32 ～ 63 int[ 2 ] → x = 64 ～ 95 int[ 3 ] → x = 96 ～ 127 int[ 4 ] → x = 128 ～ 159
// 
// [0000･･･ <32個分のビット> ･･･0000][0000･･･ <32個分のビット> ･･･0000][0000･･･ <32個分のビット> ･･･0000][0000･･･ <32個分のビット> ･･･0000]
// [0000･･･ <32個分のビット> ･･･0000][0000･･･ <32個分のビット> ･･･0000][0000･･･ <32個分のビット> ･･･0000][0000･･･ <32個分のビット> ･･･0000]
// [0000･･･ <32個分のビット> ･･･0000][0000･･･ <32個分のビット> ･･･0000][0000･･･ <32個分のビット> ･･･0000][0000･･･ <32個分のビット> ･･･0000]
// ↓これが160列並びます
int field[FIELD_HEIGHT][FIELD_WORD_WIDTH] = {};


// bool から ビットに変換する関数
bool IsAlive(int _x, int _y) {
    // x座標から、何番目のint配列に入っているかを求める
    int wordIndex = _x / BITS_PER_WORD;
    // x座標から、int配列の中の何ビット目なのかを求める
    int bitIndex = _x % BITS_PER_WORD;
    // 対応するビットが1なら、生きているセルと判断する 
    //（int[wordIndex] のなかの int ･･･00000 の指定の場所をみる）
    return (field[_y][wordIndex] & (1 << bitIndex)) != 0;
}

void SetAlive(int _x, int _y) {
    // x座標から、何番目のintに入っているかを求める
    int wordIndex = _x / BITS_PER_WORD;
    // x座標から、intの中の何ビット目なのかを求める
    int bitIndex = _x % BITS_PER_WORD;

    // 1 << bitIndex で 1 を左に動かし 対応するビットを1にする( 00000000 → 0000100)
    field[_y][wordIndex] |= (1 << bitIndex);
}

void SetDead(int _x, int _y) {
    // x座標から、何番目のintに入っているかを求める
    int wordIndex = _x / BITS_PER_WORD;
    // x座標から、intの中の何ビット目なのかを求める
    int bitIndex = _x % BITS_PER_WORD;

    // 対応するビットを0にする
    //  11101101 ←元のビット
    //& 11111011 ←編集したいビット00000100 の~反転 
    //------------
    //  11101001
    field[_y][wordIndex] &= ~(1 << bitIndex);
}

// boolからfield の中をビットで生死を設定する
void SetCell(int _x, int _y, bool _alive) {
    if (_alive) {
        SetAlive(_x, _y);
    }
    else {
        SetDead(_x, _y);
    }
}

// [4]関数を宣言する場所

// [4-1]フィールドを描画する関数を宣言する
void DrawField() {

    system("cls");// [4-1-1]画面をクリアする

    //[4-1-2]フィールドの全ての行を反復する
    for (int y = 0; y < FIELD_HEIGHT; y++) {

        //[4-1-3]フィールドの全ての列を反復する
        for (int x = 0; x < FIELD_WIDTH; x++) {
            // [4-1-4]セルが生きていれば「■」を、死んでいれば「 」を描画する
            printf("%s", IsAlive(x, y) ? "■" : " "); // ? はif文の略式
        }

        printf("\n");//[4-1-5]１行描画するごとに改行する

    }

}

// [4-2]対象のセルと隣接する生きたセルの数を取得する関数を宣言する
int GetLivingCellsCount(int _x, int _y) {

    int count = 0; // [4-2-1]生きているセルを数えるカウンターを宣言する

    //[4-2-2]対象のセルの上下１マスを反復する
    for (int y = _y - 1; y <= _y + 1; y++) {

        /*
        //[4-2-3]上下にループさせない場合は、行が範囲内かどうかを判定する
        if( (y < 0 ) || (y >= FIELD_HEIGHT)){
         continue;//[4-2-4]範囲外の行なのでスキップする
        }
        */

        //[4-2-5]上下にループしたy座標を宣言する
        int roopedY = (FIELD_HEIGHT + y) % FIELD_HEIGHT;

        // [4-2-6]対象のセルの左右1マスを反復する
        for (int x = _x + -1; x <= _x + 1; x++) {

            /*
            //[4-2-3]左右にループさせない場合は、行が範囲内かどうかを判定する
            if( ( x < 0 ) || ( x >= FIELD_WIDTH ) ){
             continue;//[4-2-8]範囲外の行なのでスキップする
            }
            */

            //[4-2-9]左右にループしたX座標を宣言する
            int roopedX = (FIELD_WIDTH + x) % FIELD_WIDTH;

            //[4-2-10]対象の座標が、中心のセルと同じかどうかを判断する
            if ((roopedX == _x) && (roopedY == _y)) {
                continue;// [4-2-11]対象の座標をスキップする
            }

            //[4-2-12]対象のセルが生きていれば1を、死んでいれば0を加算する
            count += IsAlive(roopedX, roopedY) ? 1 : 0;//field[ roopedY ][ roopedX ];

        }
    }

    return count; // [4-2-13]生きているセルの数を返す
}

//[4-3]1ステップ文のシミュレーションを実行する関数を宣言する
void StepSimulation() {
    //[4-3-1]次の世代のフィールドを宣言する
    int nextField[FIELD_HEIGHT][FIELD_WORD_WIDTH] = {};

    //[4-3-2]全ての行を反復する
    for (int y = 0; y < FIELD_HEIGHT; y++) {
        //[4-3-3]全ての列を反復する
        for (int x = 0; x < FIELD_WIDTH; x++) {

            //[4-3-4]対象のセルと隣接する、生きているセルの数を宣言する
            int livingCellCount = GetLivingCellsCount(x, y);

            bool alive = IsAlive(x, y);

            //[4-3-5]隣接する生きたセルの数で分岐する
            if (livingCellCount <= 1) {//[4-3-5]１個なら
                alive = false;
            }
            else if (livingCellCount == 2) {//[4-3-7]2個なら
                //[4-3-8]現状維持
                //alive = field[ y ][ x ];
            }
            else if (livingCellCount == 3) {//[4-3-9]3個なら
                //[4-3-10]対象のセルを誕生/生存させる
                alive = true;
            }
            else {//[4-3-11]４つ以上なら
                //[4-3-12]対象のセルを死滅させる
                alive = false;
            }

            if (alive) {
                int wordIndex = x / BITS_PER_WORD;
                int bitIndex = x % BITS_PER_WORD;
                // 対応するビットを1にする
                nextField[y][wordIndex] |= (1 << bitIndex);
            }

        }
    }

    //[4-3-13]次のステップのフィールドを、現在のフィールドにコピーする
    memcpy(field, nextField, sizeof field);

}

// [4-4]パターンをフィールドにコピーする関数を宣言する
void PatternTransfer(
    int _destX, int _destY,
    int _srcWidth, int _srcHeight,
    bool* _pPattern) {
    //[4-4-1]パターン内の全ての行を反復する
    for (int y = 0; y < _srcHeight; y++) {

        //[4-4-2]パターン内の全ての列を反復する
        for (int x = 0; x < _srcWidth; x++) {

            bool alive = _pPattern[y * _srcWidth + x];

            //新しいビットフィルドへコピーする
            SetCell(_destX + x, _destY + y, alive);

        }

    }


}


// [4-5]プログラム実行の開始点を宣言する
int main() {

    const int patternWidth = 128;// [4-5-1]パターンの幅を宣言する
    const int patternHeight = 128;// [4-5-2]パターンの高さを宣言する

    // [4-5-3]パターンを宣言する
    bool pattern[patternHeight][patternWidth] =
    {

     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
     {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}

    };

    //[4-5-4]パターンをフィールドの中心にコピーする
    PatternTransfer(
        FIELD_WIDTH / 2 - patternWidth / 2,     // int _destX
        FIELD_HEIGHT / 2 - patternHeight / 2,   // int _destY
        patternWidth,                           // int _srcWidth
        patternHeight,                          // int _srcHeight
        (bool*)pattern);                       // bool* _pPattern


    clock_t lastClock = clock();// [4-5-5]前回の経過時間を宣言する

    // [4-5-6]メインループ
    while (1) {

        clock_t newClock = clock();//[4-5-7]現在の経過時間を宣言する

        // [4-5-8]前回の経過時間から、待機時間が経過していなければ
        if (newClock < lastClock + INTERVAL) {
            continue;// [4-5-9]待機状態に戻る
        }

        // [4-5-10]前回経過時間を、現在の経過時間で更新する
        lastClock = newClock;

        DrawField();// [4-5-11]フィールドを描画する関数を呼び出す

        //_getch();// [4-5-12]キーボード入力を待つ

        StepSimulation();//[4-5-13]シミュレーションを進める

    }

}







